load-tests/results/high-traffic-p95fix-cpu4-500x500/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m01.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
high_traffic_booking   [   0% ] 500 VUs  00m00.3s/10m0s  000/500 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 1000    395.884009/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 500    197.942005/s
    reservations_created...............: 500    197.942005/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=696.62ms min=450.31ms med=717.16ms p(90)=791.61ms p(95)=797.75ms p(99)=803.72ms max=875.12ms

    HTTP
    http_req_duration..................: avg=695.6ms  min=179.18ms med=716.95ms p(90)=791.51ms p(95)=797.75ms p(99)=803.71ms max=875.12ms
      { expected_response:true }.......: avg=695.6ms  min=179.18ms med=716.95ms p(90)=791.51ms p(95)=797.75ms p(99)=803.71ms max=875.12ms
    http_req_failed....................: 0.00%  0 out of 503
    http_reqs..........................: 503    199.129657/s

    EXECUTION
    iteration_duration.................: avg=719.44ms min=488.87ms med=736.87ms p(90)=797.18ms p(95)=803.8ms  p(99)=815.41ms max=940.06ms
    iterations.........................: 500    197.942005/s
    vus................................: 500    min=0        max=500
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 386 kB 153 kB/s
    data_sent..........................: 289 kB 114 kB/s



running (00m02.5s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m00.9s/10m0s  500/500 shared iters